#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Redundant ignore_changes element

  on eks.tf line 192, in resource "aws_launch_template" "eks_launch_template":
 192: resource "aws_launch_template" "eks_launch_template" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute latest_version is decided by the provider alone and therefore
there can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_route.eks_private_nat_route: Refreshing state... [id=r-rtb-04deeeb601cf703161080289494]
aws_route_table.eks_private_rt: Refreshing state... [id=rtb-04deeeb601cf70316]
aws_iam_role_policy_attachment.eks_node_AmazonEKSWorkerNodePolicy: Refreshing state... [id=eks-node-role-20250809163518302100000005]
aws_eip.eks_nat: Refreshing state... [id=eipalloc-0cc6ede4aaef60bc7]
aws_subnet.eks_private_b: Refreshing state... [id=subnet-03874c96983f6ab85]
aws_route_table_association.eks_private_rta_b: Refreshing state... [id=rtbassoc-0753b3fab0d7c32b0]
aws_iam_role.eks_node_role: Refreshing state... [id=eks-node-role]
aws_ssm_parameter.foo: Refreshing state... [id=foo]
aws_instance.eks_mgmt: Refreshing state... [id=i-05e1e403adc33daf8]
aws_eks_addon.vpc_cni: Refreshing state... [id=eks-cluster:vpc-cni]
aws_iam_instance_profile.mgmt_vm_profile: Refreshing state... [id=eks-mgmt-vm-profile]
aws_subnet.eks_private_a: Refreshing state... [id=subnet-092f2accdeb68c8a9]
aws_iam_role_policy_attachment.eks_node_AmazonEKS_CNI_Policy: Refreshing state... [id=eks-node-role-20250809163518376000000007]
aws_internet_gateway.eks_igw: Refreshing state... [id=igw-035b3ee2743c842aa]
aws_iam_role_policy_attachment.eks_cluster_AmazonEKSClusterPolicy: Refreshing state... [id=eks-cluster-role-20250809163518129100000002]
aws_eks_node_group.eks_nodes: Refreshing state... [id=eks-cluster:eks-node-group]
aws_iam_role_policy_attachment.mgmt_vm_eks_access: Refreshing state... [id=eks-mgmt-vm-role-20250809163518203600000004]
aws_iam_role.eks_cluster_role: Refreshing state... [id=eks-cluster-role]
aws_nat_gateway.eks_nat: Refreshing state... [id=nat-0a9db14da4d6f0848]
aws_security_group.eks_sg: Refreshing state... [id=sg-0a0363236ae758506]
aws_iam_role_policy_attachment.mgmt_vm_ssm: Refreshing state... [id=eks-mgmt-vm-role-20250809163518165700000003]
aws_route_table_association.eks_private_rta_a: Refreshing state... [id=rtbassoc-0344e588a895fbbcf]
aws_iam_role.mgmt_vm_role: Refreshing state... [id=eks-mgmt-vm-role]
aws_vpc.eks_vpc: Refreshing state... [id=vpc-01789470d1eb7664e]
aws_eks_cluster.eks: Refreshing state... [id=eks-cluster]
aws_iam_role_policy_attachment.eks_node_AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=eks-node-role-20250809163518337300000006]
aws_eks_addon.coredns: Refreshing state... [id=eks-cluster:coredns]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.tls_certificate.cluster[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "cluster" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # aws_eip.eks_nat will be destroyed
  # (because aws_eip.eks_nat is not in configuration)
  - resource "aws_eip" "eks_nat" {
      - allocation_id        = "eipalloc-0cc6ede4aaef60bc7" -> null
      - arn                  = "arn:aws:ec2:us-east-1:381492080129:elastic-ip/eipalloc-0cc6ede4aaef60bc7" -> null
      - association_id       = "eipassoc-0613d6a2b5c413814" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-0cc6ede4aaef60bc7" -> null
      - network_border_group = "us-east-1" -> null
      - network_interface    = "eni-05a6cfffc0e4ca46d" -> null
      - private_dns          = "ip-10-20-1-52.ec2.internal" -> null
      - private_ip           = "10.20.1.52" -> null
      - public_dns           = "ec2-3-210-7-210.compute-1.amazonaws.com" -> null
      - public_ip            = "3.210.7.210" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Name" = "eks-nat-eip"
        } -> null
      - tags_all             = {
          - "Name" = "eks-nat-eip"
        } -> null
      - vpc                  = true -> null
    }

  # aws_eip.nat will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "eks-nat-eip"
        }
      + tags_all             = {
          + "Name" = "eks-nat-eip"
        }
      + vpc                  = (known after apply)
    }

  # aws_eks_addon.coredns is tainted, so must be replaced
-/+ resource "aws_eks_addon" "coredns" {
      ~ addon_version               = "v1.11.1-eksbuild.4" -> "v1.11.4-eksbuild.10"
      ~ arn                         = "arn:aws:eks:us-east-1:381492080129:addon/eks-cluster/coredns/eecc47dc-6983-eb10-b694-7799fc71eac5" -> (known after apply)
      ~ cluster_name                = "eks-cluster" -> "num-mgmt-prod-eks-cluster"
      + configuration_values        = (known after apply)
      ~ created_at                  = "2025-08-09T16:45:11Z" -> (known after apply)
      ~ id                          = "eks-cluster:coredns" -> (known after apply)
      ~ modified_at                 = "2025-08-09T16:48:46Z" -> (known after apply)
      - resolve_conflicts_on_update = "OVERWRITE" -> null
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_eks_addon.kube-proxy will be created
  + resource "aws_eks_addon" "kube-proxy" {
      + addon_name                  = "kube-proxy"
      + addon_version               = "v1.32.3-eksbuild.7"
      + arn                         = (known after apply)
      + cluster_name                = "num-mgmt-prod-eks-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # aws_eks_addon.vpc-cni will be created
  + resource "aws_eks_addon" "vpc-cni" {
      + addon_name                  = "vpc-cni"
      + addon_version               = "v1.19.5-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "num-mgmt-prod-eks-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # aws_eks_addon.vpc_cni will be destroyed
  # (because aws_eks_addon.vpc_cni is not in configuration)
  - resource "aws_eks_addon" "vpc_cni" {
      - addon_name                  = "vpc-cni" -> null
      - addon_version               = "v1.18.1-eksbuild.1" -> null
      - arn                         = "arn:aws:eks:us-east-1:381492080129:addon/eks-cluster/vpc-cni/a4cc47dc-6987-9fbb-605c-176b20ee58b3" -> null
      - cluster_name                = "eks-cluster" -> null
      - created_at                  = "2025-08-09T16:45:11Z" -> null
      - id                          = "eks-cluster:vpc-cni" -> null
      - modified_at                 = "2025-08-09T16:48:41Z" -> null
      - resolve_conflicts_on_create = "OVERWRITE" -> null
      - resolve_conflicts_on_update = "OVERWRITE" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
    }

  # aws_eks_cluster.aws_eks will be created
  + resource "aws_eks_cluster" "aws_eks" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + enabled_cluster_log_types     = [
          + "audit",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "num-mgmt-prod-eks-cluster"
      + platform_version              = (known after apply)
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "Name" = "mgmt-eks-cluster"
        }
      + tags_all                      = {
          + "Name" = "mgmt-eks-cluster"
        }
      + version                       = "1.32"

      + access_config {
          + authentication_mode                         = (known after apply)
          + bootstrap_cluster_creator_admin_permissions = (known after apply)
        }

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)

          + elastic_load_balancing {
              + enabled = (known after apply)
            }
        }

      + upgrade_policy {
          + support_type = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = false
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_cluster.eks will be destroyed
  # (because aws_eks_cluster.eks is not in configuration)
  - resource "aws_eks_cluster" "eks" {
      - arn                           = "arn:aws:eks:us-east-1:381492080129:cluster/eks-cluster" -> null
      - bootstrap_self_managed_addons = true -> null
      - certificate_authority         = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJRUZQdFV5czRDaUF3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TlRBNE1Ea3hOak0xTlRCYUZ3MHpOVEE0TURjeE5qUXdOVEJhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUURaekc3Z1V2dmFJSVJZaUZ5SEVTMFFUQmd1aExDSmc0czgxQnIxb3dQeHRvNnREc0YvRmlNS3YxYjUKU2kzMlEyblFBU1JNdFRpa2dMMmV3cHNVRzNjdGVDV0o0ZVNWcjZaR2k1eWVLQkg0TE1tKzRBMXB3MURNcTVZYgpNVVNDK2FURTFYdnFZSmVQWFZWeFR5di91UzBwREJMZjR1eVZVS0VrSnBBLytnZUdQVG5qeHVHaDVYcHlMTFR2CnFkaFd0UzRxSmIwcGg1ZVRQMGRPd3M2WTduMWRGNVlacXU1NlRCOXlZazArYUFYWmhndmlIQUhqQlJjTFVUamEKSGlZM0NuanNBMW82dWxHWWIveWE3emJXZitqQkMvZFE3Rk1Ec0Vvb3JMSE45SDd5dGQ2WElYckVDTDhZcGlqaApnZkhaYldqb1hpL1dLZ2w3dWVLTzk4ZVR0YkxIQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJRS3Fra3dKVGZFdDZYRVBhMVc2Y25nSEJVK1V6QVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQm1hNWJ3bWVQeAo2RStKY0xOZFl6L216TXhtR1REamU1bFI0Z1BRck5kak52REZidm4yRnVaOUtRcXBneDVoK1BNWSsyS3BueHU3CnhMVGpRVEorMWY5UVl6WHJHUkFoUmlGaXpaNGtSMnRsTUwvb1dzZEwvVzRPWFBUek92YWZ3bVlrMmJVL0pzYVYKUEZ2MGh1MWRDTStJZ1BneVhnTGdGZEx0cVBRYXE4cGV6enV5WU02YmQ0VkJkZmxLSFl3U1FFaDJoVUVCT3VIMgpoRkIzVE9UYVZtd2k1YzhrZE0ydERjbnpaZzFoWHE1Z3NkRlc1bXVPRXFIQU9uWmJHRW1PMGJhaWJQZkpVUHFSCjJpaXF5RUFjSWpJNldYQVNwbDQ2OE1NRjZYcWZoKzdNS3lTNUFMQnF0cm8yZ0NRei9VeWlaUHVaYytuSDVhK0cKazJodjJwTTJwQm1kCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> null
      - created_at                    = "2025-08-09T16:35:35Z" -> null
      - enabled_cluster_log_types     = [] -> null
      - endpoint                      = "https://BB5889301F291E6BD02FD401EE6BD48F.gr7.us-east-1.eks.amazonaws.com" -> null
      - id                            = "eks-cluster" -> null
      - identity                      = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-east-1.amazonaws.com/id/BB5889301F291E6BD02FD401EE6BD48F"
                    },
                ]
            },
        ] -> null
      - name                          = "eks-cluster" -> null
      - platform_version              = "eks.16" -> null
      - role_arn                      = "arn:aws:iam::381492080129:role/eks-cluster-role" -> null
      - status                        = "ACTIVE" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
      - version                       = "1.32" -> null

      - access_config {
          - authentication_mode                         = "CONFIG_MAP" -> null
          - bootstrap_cluster_creator_admin_permissions = true -> null
        }

      - kubernetes_network_config {
          - ip_family         = "ipv4" -> null
          - service_ipv4_cidr = "172.20.0.0/16" -> null

          - elastic_load_balancing {
              - enabled = false -> null
            }
        }

      - upgrade_policy {
          - support_type = "EXTENDED" -> null
        }

      - vpc_config {
          - cluster_security_group_id = "sg-00c77d2726c0ebed8" -> null
          - endpoint_private_access   = true -> null
          - endpoint_public_access    = false -> null
          - public_access_cidrs       = [] -> null
          - security_group_ids        = [
              - "sg-0a0363236ae758506",
            ] -> null
          - subnet_ids                = [
              - "subnet-03874c96983f6ab85",
              - "subnet-092f2accdeb68c8a9",
            ] -> null
          - vpc_id                    = "vpc-01789470d1eb7664e" -> null
        }
    }

  # aws_eks_node_group.eks_nodes will be destroyed
  # (because aws_eks_node_group.eks_nodes is not in configuration)
  - resource "aws_eks_node_group" "eks_nodes" {
      - ami_type        = "AL2023_x86_64_STANDARD" -> null
      - arn             = "arn:aws:eks:us-east-1:381492080129:nodegroup/eks-cluster/eks-node-group/46cc47dc-697f-8c34-78c6-e57728f95378" -> null
      - capacity_type   = "ON_DEMAND" -> null
      - cluster_name    = "eks-cluster" -> null
      - disk_size       = 20 -> null
      - id              = "eks-cluster:eks-node-group" -> null
      - instance_types  = [
          - "t3.medium",
        ] -> null
      - labels          = {} -> null
      - node_group_name = "eks-node-group" -> null
      - node_role_arn   = "arn:aws:iam::381492080129:role/eks-node-role" -> null
      - release_version = "1.32.7-20250807" -> null
      - resources       = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-eks-node-group-46cc47dc-697f-8c34-78c6-e57728f95378"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> null
      - status          = "CREATE_FAILED" -> null
      - subnet_ids      = [
          - "subnet-03874c96983f6ab85",
          - "subnet-092f2accdeb68c8a9",
        ] -> null
      - tags            = {} -> null
      - tags_all        = {} -> null
      - version         = "1.32" -> null

      - scaling_config {
          - desired_size = 2 -> null
          - max_size     = 2 -> null
          - min_size     = 2 -> null
        }

      - update_config {
          - max_unavailable            = 1 -> null
          - max_unavailable_percentage = 0 -> null
        }
    }

  # aws_eks_node_group.node will be created
  + resource "aws_eks_node_group" "node" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "num-mgmt-prod-eks-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = "num-mgmt-prod-node"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Name" = "mgmt-eks-node"
        }
      + tags_all               = {
          + "Name" = "mgmt-eks-node"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = "prod_eks_launch_template"
          + version = (known after apply)
        }

      + node_repair_config {
          + enabled = (known after apply)
        }

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 1
        }

      + update_config {
          + max_unavailable            = (known after apply)
          + max_unavailable_percentage = (known after apply)
        }
    }

  # aws_iam_instance_profile.mgmt_vm_profile will be destroyed
  # (because aws_iam_instance_profile.mgmt_vm_profile is not in configuration)
  - resource "aws_iam_instance_profile" "mgmt_vm_profile" {
      - arn         = "arn:aws:iam::381492080129:instance-profile/eks-mgmt-vm-profile" -> null
      - create_date = "2025-08-09T16:35:18Z" -> null
      - id          = "eks-mgmt-vm-profile" -> null
      - name        = "eks-mgmt-vm-profile" -> null
      - path        = "/" -> null
      - role        = "eks-mgmt-vm-role" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
      - unique_id   = "AIPAVRUVTFYAQRGYWFE7X" -> null
    }

  # aws_iam_openid_connect_provider.default[0] will be created
  + resource "aws_iam_openid_connect_provider" "default" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # aws_iam_role.eks_cluster will be created
  + resource "aws_iam_role" "eks_cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "num-mgmt-prod-eks-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.eks_cluster_role will be destroyed
  # (because aws_iam_role.eks_cluster_role is not in configuration)
  - resource "aws_iam_role" "eks_cluster_role" {
      - arn                   = "arn:aws:iam::381492080129:role/eks-cluster-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "eks.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-08-09T16:35:17Z" -> null
      - force_detach_policies = false -> null
      - id                    = "eks-cluster-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "eks-cluster-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAVRUVTFYA2CKWMLFCN" -> null
    }

  # aws_iam_role.eks_node_role will be destroyed
  # (because aws_iam_role.eks_node_role is not in configuration)
  - resource "aws_iam_role" "eks_node_role" {
      - arn                   = "arn:aws:iam::381492080129:role/eks-node-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-08-09T16:35:17Z" -> null
      - force_detach_policies = false -> null
      - id                    = "eks-node-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly",
          - "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy",
          - "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "eks-node-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAVRUVTFYA2J4CBGMZN" -> null
    }

  # aws_iam_role.eks_nodes will be created
  + resource "aws_iam_role" "eks_nodes" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "num-mgmt-prod-eks-node-group"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.mgmt_vm_role will be destroyed
  # (because aws_iam_role.mgmt_vm_role is not in configuration)
  - resource "aws_iam_role" "mgmt_vm_role" {
      - arn                   = "arn:aws:iam::381492080129:role/eks-mgmt-vm-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-08-09T16:35:17Z" -> null
      - force_detach_policies = false -> null
      - id                    = "eks-mgmt-vm-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
          - "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "eks-mgmt-vm-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAVRUVTFYAY6Y4ZI4LK" -> null
    }

  # aws_iam_role_policy.sm_policy will be created
  + resource "aws_iam_role_policy" "sm_policy" {
      + id          = (known after apply)
      + name        = "SecretsManager_readaccess"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetRandomPassword",
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                          + "secretsmanager:ListSecretVersionIds",
                          + "secretsmanager:ListSecrets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "num-mgmt-prod-eks-node-group"
    }

  # aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "num-mgmt-prod-eks-node-group"
    }

  # aws_iam_role_policy_attachment.AmazonEKSClusterPolicy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "num-mgmt-prod-eks-cluster-role"
    }

  # aws_iam_role_policy_attachment.AmazonEKSServicePolicy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKSServicePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = "num-mgmt-prod-eks-cluster-role"
    }

  # aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "num-mgmt-prod-eks-node-group"
    }

  # aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "num-mgmt-prod-eks-node-group"
    }

  # aws_iam_role_policy_attachment.AmazonS3FullAccess will be created
  + resource "aws_iam_role_policy_attachment" "AmazonS3FullAccess" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonS3FullAccess"
      + role       = "num-mgmt-prod-eks-node-group"
    }

  # aws_iam_role_policy_attachment.AmazonSQSFull-Access will be created
  + resource "aws_iam_role_policy_attachment" "AmazonSQSFull-Access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSQSFullAccess"
      + role       = "num-mgmt-prod-eks-node-group"
    }

  # aws_iam_role_policy_attachment.AmazonSQSFullAccess will be created
  + resource "aws_iam_role_policy_attachment" "AmazonSQSFullAccess" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSQSFullAccess"
      + role       = "num-mgmt-prod-eks-cluster-role"
    }

  # aws_iam_role_policy_attachment.AmazonSSMFullAccess will be created
  + resource "aws_iam_role_policy_attachment" "AmazonSSMFullAccess" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMFullAccess"
      + role       = "num-mgmt-prod-eks-node-group"
    }

  # aws_iam_role_policy_attachment.eks_cluster_AmazonEKSClusterPolicy will be destroyed
  # (because aws_iam_role_policy_attachment.eks_cluster_AmazonEKSClusterPolicy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "eks_cluster_AmazonEKSClusterPolicy" {
      - id         = "eks-cluster-role-20250809163518129100000002" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy" -> null
      - role       = "eks-cluster-role" -> null
    }

  # aws_iam_role_policy_attachment.eks_node_AmazonEC2ContainerRegistryReadOnly will be destroyed
  # (because aws_iam_role_policy_attachment.eks_node_AmazonEC2ContainerRegistryReadOnly is not in configuration)
  - resource "aws_iam_role_policy_attachment" "eks_node_AmazonEC2ContainerRegistryReadOnly" {
      - id         = "eks-node-role-20250809163518337300000006" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly" -> null
      - role       = "eks-node-role" -> null
    }

  # aws_iam_role_policy_attachment.eks_node_AmazonEKSWorkerNodePolicy will be destroyed
  # (because aws_iam_role_policy_attachment.eks_node_AmazonEKSWorkerNodePolicy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "eks_node_AmazonEKSWorkerNodePolicy" {
      - id         = "eks-node-role-20250809163518302100000005" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy" -> null
      - role       = "eks-node-role" -> null
    }

  # aws_iam_role_policy_attachment.eks_node_AmazonEKS_CNI_Policy will be destroyed
  # (because aws_iam_role_policy_attachment.eks_node_AmazonEKS_CNI_Policy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "eks_node_AmazonEKS_CNI_Policy" {
      - id         = "eks-node-role-20250809163518376000000007" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy" -> null
      - role       = "eks-node-role" -> null
    }

  # aws_iam_role_policy_attachment.mgmt_vm_eks_access will be destroyed
  # (because aws_iam_role_policy_attachment.mgmt_vm_eks_access is not in configuration)
  - resource "aws_iam_role_policy_attachment" "mgmt_vm_eks_access" {
      - id         = "eks-mgmt-vm-role-20250809163518203600000004" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy" -> null
      - role       = "eks-mgmt-vm-role" -> null
    }

  # aws_iam_role_policy_attachment.mgmt_vm_ssm will be destroyed
  # (because aws_iam_role_policy_attachment.mgmt_vm_ssm is not in configuration)
  - resource "aws_iam_role_policy_attachment" "mgmt_vm_ssm" {
      - id         = "eks-mgmt-vm-role-20250809163518165700000003" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore" -> null
      - role       = "eks-mgmt-vm-role" -> null
    }

  # aws_instance.eks_mgmt will be destroyed
  # (because aws_instance.eks_mgmt is not in configuration)
  - resource "aws_instance" "eks_mgmt" {
      - ami                                  = "ami-0a51a024e4b0c1050" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:381492080129:instance/i-05e1e403adc33daf8" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "us-east-1a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 2 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - iam_instance_profile                 = "eks-mgmt-vm-profile" -> null
      - id                                   = "i-05e1e403adc33daf8" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t3.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-0cfe4d2a5c5037024" -> null
      - private_dns                          = "ip-10-20-1-33.ec2.internal" -> null
      - private_ip                           = "10.20.1.33" -> null
      - public_dns                           = "ec2-34-204-83-30.compute-1.amazonaws.com" -> null
      - public_ip                            = "34.204.83.30" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-092f2accdeb68c8a9" -> null
      - tags                                 = {
          - "Name" = "eks-mgmt-vm"
        } -> null
      - tags_all                             = {
          - "Name" = "eks-mgmt-vm"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "038cdca943928ebc9c5cbae761165f011b2532d7" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-0a0363236ae758506",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-0ad8458b4847c9443" -> null
          - volume_size           = 2 -> null
          - volume_type           = "gp3" -> null
        }
    }

  # aws_instance.vs-test will be created
  + resource "aws_instance" "vs-test" {
      + ami                                  = "ami-00beae93a2d981137"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = "us-east-1d"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0d0e3828e26eb661c"
      + tags                                 = {
          + "Name" = "VS-instance"
        }
      + tags_all                             = {
          + "Name" = "VS-instance"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_internet_gateway.eks_igw will be destroyed
  # (because aws_internet_gateway.eks_igw is not in configuration)
  - resource "aws_internet_gateway" "eks_igw" {
      - arn      = "arn:aws:ec2:us-east-1:381492080129:internet-gateway/igw-035b3ee2743c842aa" -> null
      - id       = "igw-035b3ee2743c842aa" -> null
      - owner_id = "381492080129" -> null
      - tags     = {
          - "Name" = "eks-igw"
        } -> null
      - tags_all = {
          - "Name" = "eks-igw"
        } -> null
      - vpc_id   = "vpc-01789470d1eb7664e" -> null
    }

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "eks-internet-gateway"
        }
      + tags_all = {
          + "Name" = "eks-internet-gateway"
        }
      + vpc_id   = (known after apply)
    }

  # aws_launch_template.eks_launch_template will be created
  + resource "aws_launch_template" "eks_launch_template" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + image_id        = "i-0ae66b4aab6fe2362"
      + latest_version  = (known after apply)
      + name            = "prod_eks_launch_template"
      + name_prefix     = (known after apply)
      + tags_all        = (known after apply)
      + user_data       = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + iops                       = (known after apply)
              + throughput                 = (known after apply)
              + volume_initialization_rate = (known after apply)
              + volume_size                = 30
              + volume_type                = "gp3"
            }
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "CreatedBy" = "Terraform"
            }
        }
    }

  # aws_nat_gateway.eks_nat will be destroyed
  # (because aws_nat_gateway.eks_nat is not in configuration)
  - resource "aws_nat_gateway" "eks_nat" {
      - allocation_id                      = "eipalloc-0cc6ede4aaef60bc7" -> null
      - association_id                     = "eipassoc-0613d6a2b5c413814" -> null
      - connectivity_type                  = "public" -> null
      - id                                 = "nat-0a9db14da4d6f0848" -> null
      - network_interface_id               = "eni-05a6cfffc0e4ca46d" -> null
      - private_ip                         = "10.20.1.52" -> null
      - public_ip                          = "3.210.7.210" -> null
      - secondary_allocation_ids           = [] -> null
      - secondary_private_ip_address_count = 0 -> null
      - secondary_private_ip_addresses     = [] -> null
      - subnet_id                          = "subnet-092f2accdeb68c8a9" -> null
      - tags                               = {
          - "Name" = "eks-nat"
        } -> null
      - tags_all                           = {
          - "Name" = "eks-nat"
        } -> null
    }

  # aws_nat_gateway.nat will be created
  + resource "aws_nat_gateway" "nat" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "eks-nat-gateway"
        }
      + tags_all                           = {
          + "Name" = "eks-nat-gateway"
        }
    }

  # aws_route.eks_private_nat_route will be destroyed
  # (because aws_route.eks_private_nat_route is not in configuration)
  - resource "aws_route" "eks_private_nat_route" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-04deeeb601cf703161080289494" -> null
      - nat_gateway_id         = "nat-0a9db14da4d6f0848" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-04deeeb601cf70316" -> null
      - state                  = "active" -> null
    }

  # aws_route_table.eks_private_rt will be destroyed
  # (because aws_route_table.eks_private_rt is not in configuration)
  - resource "aws_route_table" "eks_private_rt" {
      - arn              = "arn:aws:ec2:us-east-1:381492080129:route-table/rtb-04deeeb601cf70316" -> null
      - id               = "rtb-04deeeb601cf70316" -> null
      - owner_id         = "381492080129" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0a9db14da4d6f0848"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "eks-private-rt"
        } -> null
      - tags_all         = {
          - "Name" = "eks-private-rt"
        } -> null
      - vpc_id           = "vpc-01789470d1eb7664e" -> null
    }

  # aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "eks-private-route-table"
        }
      + tags_all         = {
          + "Name" = "eks-private-route-table"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public_route_table will be created
  + resource "aws_route_table" "public_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "eks-public-route-table"
        }
      + tags_all         = {
          + "Name" = "eks-public-route-table"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.eks_private_rta_a will be destroyed
  # (because aws_route_table_association.eks_private_rta_a is not in configuration)
  - resource "aws_route_table_association" "eks_private_rta_a" {
      - id             = "rtbassoc-0344e588a895fbbcf" -> null
      - route_table_id = "rtb-04deeeb601cf70316" -> null
      - subnet_id      = "subnet-092f2accdeb68c8a9" -> null
    }

  # aws_route_table_association.eks_private_rta_b will be destroyed
  # (because aws_route_table_association.eks_private_rta_b is not in configuration)
  - resource "aws_route_table_association" "eks_private_rta_b" {
      - id             = "rtbassoc-0753b3fab0d7c32b0" -> null
      - route_table_id = "rtb-04deeeb601cf70316" -> null
      - subnet_id      = "subnet-03874c96983f6ab85" -> null
    }

  # aws_route_table_association.private_rt_a will be created
  + resource "aws_route_table_association" "private_rt_a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_rt_b will be created
  + resource "aws_route_table_association" "private_rt_b" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_rt_a will be created
  + resource "aws_route_table_association" "public_rt_a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_rt_b will be created
  + resource "aws_route_table_association" "public_rt_b" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.eks_cluster will be created
  + resource "aws_security_group" "eks_cluster" {
      + arn                    = (known after apply)
      + description            = "Cluster communication with worker nodes"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "prod-num-mgmt-eks-cluster-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                                            = "mgmt-eks-cluster-sg"
          + "kubernetes.io/cluster/num-mgmt-prod-eks-cluster" = "owned"
        }
      + tags_all               = {
          + "Name"                                            = "mgmt-eks-cluster-sg"
          + "kubernetes.io/cluster/num-mgmt-prod-eks-cluster" = "owned"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.eks_node will be created
  + resource "aws_security_group" "eks_node" {
      + arn                    = (known after apply)
      + description            = "Worker nodes SG"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "prod-num-mgmt-eks-node-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "mgmt-eks-node-sg"
        }
      + tags_all               = {
          + "Name" = "mgmt-eks-node-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.eks_sg will be destroyed
  # (because aws_security_group.eks_sg is not in configuration)
  - resource "aws_security_group" "eks_sg" {
      - arn                    = "arn:aws:ec2:us-east-1:381492080129:security-group/sg-0a0363236ae758506" -> null
      - description            = "Allow EKS API and node comms from VPC" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
        ] -> null
      - id                     = "sg-0a0363236ae758506" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          - {
              - cidr_blocks      = [
                  - "10.20.0.0/16",
                ]
              - description      = "Kubelet API"
              - from_port        = 10250
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 10250
            },
          - {
              - cidr_blocks      = [
                  - "10.20.0.0/16",
                ]
              - description      = "Kubernetes API"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
        ] -> null
      - name                   = "eks-sg" -> null
      - owner_id               = "381492080129" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "eks-sg"
        } -> null
      - tags_all               = {
          - "Name" = "eks-sg"
        } -> null
      - vpc_id                 = "vpc-01789470d1eb7664e" -> null
    }

  # aws_security_group_rule.cluster_inbound will be created
  + resource "aws_security_group_rule" "cluster_inbound" {
      + description              = "Allow worker nodes to communicate with the cluster API Server"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.cluster_inbound_subnet will be created
  + resource "aws_security_group_rule" "cluster_inbound_subnet" {
      + cidr_blocks              = [
          + "10.20.1.0/24",
        ]
      + description              = "Mgmt Server subnet"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.cluster_outbound will be created
  + resource "aws_security_group_rule" "cluster_outbound" {
      + description              = "Allow cluster API Server to communicate with the worker nodes"
      + from_port                = 1024
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "egress"
    }

  # aws_security_group_rule.cluster_outbound_node will be created
  + resource "aws_security_group_rule" "cluster_outbound_node" {
      + description              = "Allow cluster API Server to communicate with the worker nodes on API server extension"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.node_inbound_master will be created
  + resource "aws_security_group_rule" "node_inbound_master" {
      + description              = "Allow API Server to communicate with kubelet"
      + from_port                = 10250
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # aws_security_group_rule.node_inbound_node will be created
  + resource "aws_security_group_rule" "node_inbound_node" {
      + description              = "Allow unrestricted inbound node 2 node"
      + from_port                = -1
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "ingress"
    }

  # aws_security_group_rule.node_inbound_node_extension will be created
  + resource "aws_security_group_rule" "node_inbound_node_extension" {
      + description              = "Master to node on api server extension"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.node_inbound_webhooks will be created
  + resource "aws_security_group_rule" "node_inbound_webhooks" {
      + description              = "Master to node for webhooks"
      + from_port                = 1024
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # aws_security_group_rule.node_outbound_internet will be created
  + resource "aws_security_group_rule" "node_outbound_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow unrestricted egress for nodes"
      + from_port                = -1
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # aws_security_group_rule.node_outbound_master will be created
  + resource "aws_security_group_rule" "node_outbound_master" {
      + description              = "Allow egress from nodes to master"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.node_outbound_node will be created
  + resource "aws_security_group_rule" "node_outbound_node" {
      + description              = "Allow unrestricted outbound node 2 node"
      + from_port                = -1
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # aws_subnet.eks_private_a will be destroyed
  # (because aws_subnet.eks_private_a is not in configuration)
  - resource "aws_subnet" "eks_private_a" {
      - arn                                            = "arn:aws:ec2:us-east-1:381492080129:subnet/subnet-092f2accdeb68c8a9" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az4" -> null
      - cidr_block                                     = "10.20.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-092f2accdeb68c8a9" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "381492080129" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "eks-private-a"
        } -> null
      - tags_all                                       = {
          - "Name" = "eks-private-a"
        } -> null
      - vpc_id                                         = "vpc-01789470d1eb7664e" -> null
    }

  # aws_subnet.eks_private_b will be destroyed
  # (because aws_subnet.eks_private_b is not in configuration)
  - resource "aws_subnet" "eks_private_b" {
      - arn                                            = "arn:aws:ec2:us-east-1:381492080129:subnet/subnet-03874c96983f6ab85" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az6" -> null
      - cidr_block                                     = "10.20.2.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-03874c96983f6ab85" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "381492080129" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "eks-private-b"
        } -> null
      - tags_all                                       = {
          - "Name" = "eks-private-b"
        } -> null
      - vpc_id                                         = "vpc-01789470d1eb7664e" -> null
    }

  # aws_subnet.private_subnet_a will be created
  + resource "aws_subnet" "private_subnet_a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.20.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                            = "eks-private-a"
          + "kubernetes.io/cluster/num-mgmt-prod-eks-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"                 = "1"
        }
      + tags_all                                       = {
          + "Name"                                            = "eks-private-a"
          + "kubernetes.io/cluster/num-mgmt-prod-eks-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"                 = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private_subnet_b will be created
  + resource "aws_subnet" "private_subnet_b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.20.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                            = "eks-private-b"
          + "kubernetes.io/cluster/num-mgmt-prod-eks-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"                 = "1"
        }
      + tags_all                                       = {
          + "Name"                                            = "eks-private-b"
          + "kubernetes.io/cluster/num-mgmt-prod-eks-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"                 = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public_subnet_a will be created
  + resource "aws_subnet" "public_subnet_a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.20.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "eks-public-a"
        }
      + tags_all                                       = {
          + "Name" = "eks-public-a"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public_subnet_b will be created
  + resource "aws_subnet" "public_subnet_b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.20.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "eks-public-b"
        }
      + tags_all                                       = {
          + "Name" = "eks-public-b"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.eks_vpc will be destroyed
  # (because aws_vpc.eks_vpc is not in configuration)
  - resource "aws_vpc" "eks_vpc" {
      - arn                                  = "arn:aws:ec2:us-east-1:381492080129:vpc/vpc-01789470d1eb7664e" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.20.0.0/16" -> null
      - default_network_acl_id               = "acl-0c8583fbd3deeda67" -> null
      - default_route_table_id               = "rtb-0a886c75b90bf984a" -> null
      - default_security_group_id            = "sg-0d9fe5f27b2cf9fb0" -> null
      - dhcp_options_id                      = "dopt-0c0681ab91f8ff74b" -> null
      - enable_dns_hostnames                 = true -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-01789470d1eb7664e" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-0a886c75b90bf984a" -> null
      - owner_id                             = "381492080129" -> null
      - tags                                 = {
          - "Name" = "eks-vpc"
        } -> null
      - tags_all                             = {
          - "Name" = "eks-vpc"
        } -> null
    }

  # aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.20.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "EKS-Demo"
        }
      + tags_all                             = {
          + "Name" = "EKS-Demo"
        }
    }

Plan: 47 to add, 0 to change, 26 to destroy.

Changes to Outputs:
  + eks_cluster_id = (known after apply)

Warning: Redundant ignore_changes element

  on eks.tf line 192, in resource "aws_launch_template" "eks_launch_template":
 192: resource "aws_launch_template" "eks_launch_template" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute latest_version is decided by the provider alone and therefore
there can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @anuragrai63, Action: `pull_request`*